Data/TestFiles/cases/WaterPouring/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    // Foundation:
    
    nonConformalCyclic_on_MeshRefinement_M 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_M
    {
        type    nonConformalError;
    }

    nonConformalCyclic_on_MeshRefinement_S 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_S
    {
        type    nonConformalError;
    }


    MeshRefinement_M 
    {
        #include "MMR/vector";
    }
    MeshRefinement_S 
    {
        #include "MMR/vector";
    }


    open
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    bottle_wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    cup_wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    side_wall
    {
        type        slip;
        value       $internalField;
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

}

// ************************************************************************* //
