Data/TestFiles/cases/WaterPouring/case/0/alpha.Water
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.Water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    // Foundation:
    
    nonConformalCyclic_on_MeshRefinement_M 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_M
    {
        type    nonConformalError;
    }

    nonConformalCyclic_on_MeshRefinement_S 
    {
        type    nonConformalCyclic;
        value   $internalField;
    }

    nonConformalError_on_MeshRefinement_S
    {
        type    nonConformalError;
    }


    MeshRefinement_M 
    {
        #include "MMR/calculated";
    }
    MeshRefinement_S 
    {
        #include "MMR/calculated";
    }


    open
    {
        type        inletOutlet;
        inletValue  uniform 0.0;
        value       $internalField;
    }

    bottle_wall
    {
        type        zeroGradient;
    }

    cup_wall
    {
        type        zeroGradient;
    }

    side_wall
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
